mp-extras/SURENOO_GUITION_W5_ROUND/mpconfigboard.h
#define MICROPY_HW_BOARD_NAME               "Surenoo Guition W5 Round"
#define MICROPY_HW_MCU_NAME                 "ESP32S3"

#define MICROPY_PY_MACHINE_DAC              (0)

// CST816D Touchscreen
#define MICROPY_HW_I2C0_SCL                 (8)
#define MICROPY_HW_I2C0_SDA                 (7)

#define MICROPY_HW_SPI2_MOSI                (1)
#define MICROPY_HW_SPI2_MISO                (2)
#define MICROPY_HW_SPI2_SCK                 (3)

#define MICROPY_HW_SPI2_MOSI                (1)
#define MICROPY_HW_SPI2_MISO                (2)
#define MICROPY_HW_SPI2_SCK                 (3)

#define MICROPY_PY_SYS_SETTRACE             (1)

#define MICROPY_REPL_EMACS_KEYS             (1)
